{
	"player":"player",
	"crapette":"crapette!",
	"no": "No",
	"rules": {
		"intro":"# Rules\nCrapette is a traditional French thinking game for two players. Each player gets a deck of `52` cards. You need to get rid of your cards. The game consists in a series of piles, each of these piles having their own conditions to take/place cards. The first player to dispatch all of their cards on the board wins.",
		"layout": "## Layout\nThe game board consists in a blue zone, a red zone, and a neutral zone in the center. In their own field, each player has three piles, their *main* pile, laid horizontaly in front of them, a *discard* pile (empty at the beginning of the game) and a last pile called *crapette*, on the right. The crapette is built using `13` cards drawn from the main stack. These three piles together make the player's side. In order to win, a player needs to empty all of these three piles.\n\nThen, `4` cards are drawn from the main pile and laid out in a column, visible, vertically above the crapette pile. These piles are named *streets*. The opponent doing the same prep phase, there are `8` streets in total, `4` on each side of the board. In the space between these streets, we define `8` empty piles, called *bases*, which will be used to stack cards from a same suit.\n\nTogether, streets and bases make the neutral zone.",
		"stacks": "## Piles\n### The Crapette\nA player can pick the last card from their crapette without any condition. If they cannot place it somewhere, they leave it on top of the pile and go on with their turn. They can never place a card on top of their own crapette.\n\nA player may place a card on their *opponent* 's crapette if this card is of the same *suit* (symbol) and its value is directly adjacent (one more or one less) to the value of the card on top of the pile.\n### The Discard\nA player may pick the last card from their discard pile if and only if their crapette pile is empty. They cannot place a card on their own discard except for cards coming directly from their main pile.\n\nThe player may place a card on the *opponent* 's discard pile if the card is of the same *colour* (red/black) and its value is directly adjacent (one more or one less) to the value of the card on top of the pile.\n### The Main pile\nA player may pick a card from their main pile without any condition. They can never place cards on top of their main pile. *Attention:* once they have drawn a card from the main pile, they cannot go back. If they cannot place it, they discard this card and this action will *end their turn*.\n\nThe player can never place a card on the *opponent* 's main pile.\n### Streets\nA player may pick the last card of a street without any condition.\n\nThe player may place a card on a street if the card is of different *coulour*, and if its value is directly inferior (one less) to the value of the card on top of the pile. (Place a red 6 on a black 7, a black 10 on a red Jack, etc). It is advised to try and empty streets because one can place any card on an empty street.\n### Bases\nThe `8` center piles, empty at the beginning of the game, represent one suit for one player each. You need to stack, in ascending order (from As to King), cards from each suit, like in a game of *Solitaire*.\n\n*Note:* The origin of the card (blue player or red player) does not matter, cards are stacked without taking it into account.",
		"turn": "## Game turn\nThe player with the highest card on top of their crapette starts the game. They play until no more action is available, moving every card they can. It is advised to try and get rid of the cards of the crapette pile in priority, in order to get access to the cards from the discard pile. The player's last action is to draw a card from their main pile that they cannot play. They discard it and their turn ends. A player can choose to draw a card from their main pile at any time during their turn, but if they cannot play it, they have to discard the card and their turn ends.",
		"steal": "## Turn Stealing\nIt is *mandatory* to place cards on the bases piles when an occasion presents itself. Thus, any Ace will have to be placed on an empty base, then the 2 of that suit, then 3, etc. If a player doesn't follow this rule, by mistake or if they didn't see the opportunity, the other player says \"Crapette\" and steals their turn, as is.\n\nYou never need to play against your interests, only directly available cards count towards turn stealing.",
		"special": "## Special rules\n* One cannot place a card on a King in the opponent's field. If the last card of the opponent's crapette or discard piles is a King, while you should normally be able to place a Queen on top of it, this specific move is not allowed.\n* When the main pile is depleted, the player will turn the discard pile over to refill it.",
		"addendum": "## Addendum\nCrapette being a traditional game, rules may vary in different families, regions, and times. The rules implemented here are the rules I learned Crapette with, and they are probably different from yours. However, after several hundreds of games played with these rules, they seem to be well balanced and interesting, and will remain implemented the way that they are now."
	},
	"settings": {
		"intro":"# Settings\n",
		"rotateBoard":"Rotate the board depending on player",
		"stackHeight":"Show how many cards are in a stack on hover"
	},
	"hub": {
		"local":"Start a local game",
		"online":"Start an online game",
		"go":"go",
		"winner": "Player {{id}} wins!"
	}
}