{
	"player":"player",
	"crapette":"crapette!",
	"rules": {
		"intro":"# Règles\nLa crapette est un jeu de réflexion à deux joueurs, disposant chacun d'un paquet de `52`  cartes. Pour réduire la crapette à quelques principes simples, vous devez vous débarasser de vos cartes. Le jeu comporte plusieurs piles sur lesquelles vous pouvez poser des cartes, et ces piles ont toutes des conditions différentes pour y poser/retirer des cartes. Le premier joueur à n'avoir plus de cartes devant lui a gagné.",
		"layout": "## Layout\nLe plateau de jeu consiste en un camp bleu, un camp rouge, et une zone neutre au centre. Dans son camp, chaque joueur dispose de trois tas : son tas principal placé horizontalement, appelé *talon*, une *défausse* (vide en début de partie), et un tas appelé *crapette* sur la droite. La crapette est constituée en tirant `13` cartes face cachée depuis le talon. Ces trois tas constituent le camp du joueur. Le but pour le joueur est de ne plus avoir de carte dans aucun de ces trois tas pour gagner.\n\nEnsuite, `4` cartes sont tirées du talon et son placées en colonne, face visible, verticalement au dessus de la crapette. Ces cartes constituent les *rues*. L'adversaire ayant la même préparation, il y a huit rues, de part et d'autres du plateau. Dans l'espace entre les rues, on définit `8` piles vides, appelées *bases*, qui serviront à empiler les cartes de même symbole.\n\nLes rues et les bases forment la zone neutre.",
		"stacks": "## Les piles\n### La Crapette\nUn joueur peut prendre la dernière carte de sa crapette sans condition. Si il ne peut pas la poser, il la laisse sur le haut de la pile et continuer son tour. Il ne peut pas y poser de cartes.\n\nLe joueur peut poser une carte sur la crapette *adverse* si cette carte est de même *symbole* et sa valeur est directement adjacente (un de plus ou un de moins) à celle de la dernière carte de la pile.\n### La Défausse\nUn joueur peut prendre la dernière carte de sa défausse si et seulement si son tas de crapette est vide. Il ne peut pas y poser d'autres cartes que celles provenant de son talon.\n\nLe joueur peut poser une carte sur la défausse *adverse* si cette carte est de *couleur* (rouge/noir) différente et sa valeur est directement adjacente (un de plus ou un de moins) à celle de la dernière carte de la pile.\n### Le Talon\nUn joueur peut prendre la dernière carte de son talon sans condition. Il ne peut pas y poser de cartes. *Attention* Il ne peut pas revenir en arrière une fois une carte tirée du talon. Si il ne peut pas la poser, il défausse cette carte et cette action marque la *fin de son tour*.\n\nLe joueur ne peut jamais poser de carte sur le talon *adverse*.\n### Les Rues\nUn joueur peut prendre la dernière carte d'une rue sans condition.\n\nLe joueur peut poser une carte sur une rue à condition que cette carte soit de *couleur* différente, et ait la valeur directement inférieure à celle de la dernière carte de la pile. (On pose un 6 rouge sur un 7 noir, un Valet noir sur une Dame rouge, etc). Il est très conseillé de vider des rues pour pouvoir y poser n'importe quelle carte.\n### Les Bases\nLes piles du milieu, vides au départ, sont au nombre de huit, une par symbole et par joueur. Il faut y empiler, dans l'ordre (de l'As au Roi), les cartes de chaque symbole, comme dans le jeu de *Solitaire*.\n\n*Note :* La provenance de la carte (joueur bleu ou rouge) ne compte pas, les cartes sont empilées sans en tenir compte.",
		"turn": "## Déroulement du jeu\nLe joueur ayant la carte de plus haute valeur sur sa crapette commence le jeu. Il joue jusqu'à ne plus pouvoir jouer, en posant toutes les cartes qu'il peut. Il est conseillé de se débarrasser rapidement des cartes de la crapette afin d'avoir accès à celles de la défausse. La dernière action du joueur est de tirer une carte de son talon qu'il ne peut pas poser. Il la pose alors sur sa défausse et le tour passe au joueur adverse. Un joueur peut choisir de tirer des cartes de son talon à tout moment pendant son tour, mais si il ne peut pas jouer la carte tirée, il la défausse et termine son tour.",
		"steal": "## Vol de tour\nIl est *obligatoire* de poser une carte sur les piles de base lorsqu'une opportunité se présente. Ainsi tout As devra obligatoirement être posé sur une base, puis le 2 sur cet As, etc. Si un joueur manque à cette règle, par manque d'inattention, l'autre joueur dit \"Crapette\" et vol son tour, en l'état.\n\nVous n'avez pas besoin de jouer contre votre jeu ; seules les cartes directement accessibles comptent pour le vol de tour.",
		"special": "## Règles spéciales\n* On ne peut pas poser de carte sur un Roi dans le camp adverse. Si la dernière carte de la Crapette ou de la Défausse adverse est un roi, alors vous pourriez y poser une dame, cela n'est pas autorisé.\n* Quand le talon est vide, on retourne la défausse pour le remplir.",
		"addendum": "## Addendum\nLa Crapette étant un jeu de cartes traditionnel, les règles varient selon les régions, les familles, et les époques. Les règles implémentées ici sont celles avec lesquelles j'ai appris à jouer, elles diffèrent peut-être des vôtres. Toutefois, après plusieurs centaines de parties, ces règles semblent être équilibrées et intéressantes, aussi, je les garderai telles quelles."
	},
	"settings": {
		"intro":"# Settings\n",
		"rotateBoard":"Rotate the board depending on player",
		"stackHeight":"Show how many cards are in a stack on hover"
	},
	"hub": {
		"local":"Start a local game",
		"online":"Start an online game",
		"go":"go",
		"winner": "Player {{id}} wins!"
	}
}